tap "anomalyco/tap"
# General-purpose data compression with high compression ratio
brew "xz"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# AI pair programming in your terminal
brew "aider"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Official Amazon AWS command-line interface
brew "awscli"
# Load/unload environment variables based on $PWD
brew "direnv"
# Utility to configure multi-display resolutions and arrangements
brew "displayplacer"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Post-modern modal text editor
brew "helix"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Python cleanup script for macOS
brew "mac-cleanup-py"
# Mac App Store command-line interface
brew "mas"
# Modern and intuitive terminal-based text editor
brew "micro"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# AI on the command-line
brew "mods"
# Deep clean and optimize your Mac
brew "mole"
# Remote terminal application
brew "mosh"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Tool Command Language
brew "tcl-tk"
# Tool to build, change, and version infrastructure
brew "terraform"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode"
# Clipboard manager with advanced features
cask "copyq"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Clipboard manager
cask "maccy"
# Minimal installer for conda
cask "miniconda"
# Finds large, unwanted files and deletes them
cask "omnidisksweeper"
# Native GUI tool for relational databases
cask "tableplus"
# Terminal emulator
cask "wave"
mas "Authenticator", id: 6463820946
mas "CapCut", id: 1500855883
mas "Coffee Buzz", id: 1099454186
mas "Command X", id: 6448461551
mas "CopyClip", id: 595191960
mas "Developer", id: 640199958
mas "FTP", id: 6448847832
mas "Grammarly for Safari", id: 1462114288
mas "HotKey", id: 975890633
mas "Infuse", id: 1136220934
mas "Jump Desktop", id: 524141863
mas "Little Snitch Mini", id: 1629008763
mas "Magnet", id: 441258766
mas "Metion", id: 1530965242
mas "Microsoft Word", id: 462054704
mas "OneDrive", id: 823766827
mas "Prompt", id: 1594420480
mas "Slack", id: 803453959
mas "Surfshark", id: 1437809329
mas "Taio", id: 1527036273
mas "Telegram", id: 747648890
mas "The Camelizer", id: 1532579087
mas "The Unarchiver", id: 425424353
mas "WeChat", id: 836500024
mas "WhatsApp", id: 310633997
mas "무비스트", id: 461788075
mas "카카오톡", id: 869223134
vscode "anysphere.remote-containers"
vscode "anysphere.remote-ssh"
vscode "google.gemini-cli-vscode-ide-companion"
vscode "google.geminicodeassist"
