tap "charmbracelet/tap"
tap "hashicorp/tap"
tap "homebrew/services"
# C++ Common Libraries
brew "abseil"
# GNU compiler collection
brew "gcc"
# BSD-style licensed readline alternative
brew "libedit"
# C string library for manipulating Unicode strings
brew "libunistring"
# HTTP/2 C Library
brew "libnghttp2"
# Collection of Linux utilities
brew "util-linux"
# Open source suite of directory software
brew "openldap"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# GNOME XML library
brew "libxml2"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Message bus system, providing inter-application communication
brew "dbus"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# User-space interfaces to POSIX 1003.1e capabilities
brew "libcap"
# System and service manager
brew "systemd", link: true
# OCI container runtime monitor
brew "conmon"
# Fast and lightweight fully featured OCI runtime and C library
brew "crun"
# Text processing system for reStructuredText
brew "docutils"
# More intuitive version of du in rust
brew "dust"
# Utilities to read, write, and manipulate files in ext2/3/4 filesystems
brew "e2tools"
# Run arbitrary commands when files change
brew "entr"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# Library and utilities for processing GIFs
brew "giflib"
# OpenType text shaping engine
brew "harfbuzz"
# JPEG image codec that aids compression and decompression
brew "jpeg-turbo"
# Library to simplify the drawing of curves
brew "libspiro"
# Library of Unicode names and annotation data
brew "libuninameslist"
# Framework for layout and rendering of i18n text
brew "pango"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Command-line fuzzy finder written in Go
brew "fzf"
# Render markdown on the CLI
brew "glow"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Common error values for all GnuPG components
brew "libgpg-error"
# Library for storing/retrieving passwords and other secrets
brew "libsecret"
# New GNU portable threads library
brew "npth"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c@76"
# User-friendly front-end to ssh-agent(1)
brew "keychain"
# Kubernetes command-line interface
brew "kubernetes-cli"
# General purpose TCP-IP emulator
brew "libslirp"
# Next-gen compiler infrastructure
brew "llvm"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Utility for directing compilation
brew "make"
# Run a Kubernetes cluster locally
brew "minikube"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Remote terminal application
brew "mosh"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Linux networking base tools
brew "net-tools"
# Utility for managing network connections
brew "netcat"
# Folder synchronization with OneDrive
brew "onedrive-cli"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# User-mode networking for unprivileged network namespaces
brew "slirp4netns"
# Tool for managing OCI containers and pods
brew "podman"
# Utilities for browsing procfs
brew "procps"
# Utilities for browsing procfs
brew "procps@3"
# Modern replacement for ps written in Rust
brew "procs"
# Easily download, build, install, upgrade, and uninstall Python packages
brew "python-setuptools"
# Enhanced, multi-threaded syslogd
brew "rsyslog"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# Tool to build, change, and version infrastructure
brew "terraform"
# CLI tool to generate terraform files from existing infrastructure
brew "terraformer"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# Personal information dashboard for your terminal
brew "wtfutil"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Better and friendly vi(vim) mode plugin for ZSH
brew "zsh-vi-mode"
# A powerful terminal-based AI assistant for developers, providing intelligent coding assistance directly in your terminal.
brew "charmbracelet/tap/crush"
# AI on the command line
brew "charmbracelet/tap/mods"
# Packer
brew "hashicorp/tap/packer"
go "cmd/go"
go "cmd/gofmt"
flatpak "chat.delta.desktop"
flatpak "com.github.Matoking.protontricks"
flatpak "com.github.marhkb.Pods"
flatpak "com.github.tchx84.Flatseal"
flatpak "com.google.Chrome"
flatpak "com.heroicgameslauncher.hgl"
flatpak "com.microsoft.Edge"
flatpak "com.nvidia.geforcenow", remote: "GeForceNOW"
flatpak "com.stremio.Stremio"
flatpak "com.usebottles.bottles"
flatpak "com.visualstudio.code"
flatpak "de.haeckerfelix.Shortwave"
flatpak "dev.deedles.Trayscale"
flatpak "io.github.TransmissionRemoteGtk"
flatpak "me.iepure.devtoolbox"
flatpak "net.davidotek.pupgui2"
flatpak "net.nokyan.Resources"
flatpak "org.fcitx.Fcitx5"
flatpak "org.gnome.baobab"
flatpak "org.kde.dolphin"
flatpak "org.kde.konsole"
flatpak "org.kde.yakuake"
flatpak "org.mozilla.Thunderbird"
flatpak "org.mozilla.firefox"
flatpak "org.strawberrymusicplayer.strawberry"
flatpak "org.videolan.VLC"
flatpak "org.virt_manager.virt-manager"
